ДомПласт_локальная_база/src/Enums/ВидыПродукцииИСМПТК/ВидыПродукцииИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИСМПТК</name>
  <enumValues>
    <name>Алкогольная</name>
    <comment>alcohol</comment>
  </enumValues>
  <enumValues>
    <name>Табачная</name>
    <comment>tobacco</comment>
  </enumValues>
  <enumValues>
    <name>Обувная</name>
    <comment>shoes</comment>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеПрепараты</name>
    <comment>pharma</comment>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукция</name>
    <comment>milk</comment>
  </enumValues>
  <enumValues>
    <name>БезалкогольныеНапитки</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
</mdclass:Enum>

ДомПласт_локальная_база/src/CommonModules/ИнтеграцияИСМПТК/Module.bsl
Функция УчитываемыеВидыМаркируемойПродукции() Экспорт
	
	ВидыПродукции = Новый Массив();
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМПТК") Тогда
		
		//БМ_ИСМПТ НА_РАЗВИТИЕ	Товарные группы
		Если Константы.ВестиУчетМаркируемойОбувиИСМПТК.Получить() Тогда 
			ВидыПродукции.Добавить(Перечисления.ВидыПродукцииИСМПТК.Обувная);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемогоТабакаИСМПТК.Получить() Тогда 
			ВидыПродукции.Добавить(Перечисления.ВидыПродукцииИСМПТК.Табачная);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемойМолочкиИСМПТК.Получить() Тогда 
			ВидыПродукции.Добавить(Перечисления.ВидыПродукцииИСМПТК.МолочнаяПродукция);
		КонецЕсли;
		
		//Если Константы.ВестиУчетМаркируемогоТекстиляИСМПТК.Получить() Тогда 
		//	ВидыПродукции.Добавить(Перечисления.ВидыПродукцииИСМПТК.ЛегкаяПромышленность);
		//КонецЕсли;
		
		//Если Константы.ВестиУчетМаркируемыхЛекарствИСМПТК.Получить() Тогда 
		//	ВидыПродукции.Добавить(Перечисления.ВидыПродукцииИСМПТК.ЛекарственныеПрепараты);
		//КонецЕсли;
		
	КонецЕсли;
		
	Возврат ВидыПродукции;
	
КонецФункции

// Возвращает менеджер (модуль менеджера или общий модуль) объекта по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. также ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, менеджер которого требуется получить.
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ОбработкаМенеджер, РегистрСведенийМенеджер - менеджер объекта.
//
// Пример:
//  МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОрганизацию);
//
Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	
	МенеджерОбъекта = Неопределено;
		
	Если МенеджерОбъекта = Неопределено Тогда
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	КонецЕсли;
	
	Возврат МенеджерОбъекта;
	
КонецФункции
